{
  "articles": [
    {
      "title": "Home is complicated",
      "description": "Ever since I can remember, there was always something different about me, no matter where I was. While I was born in Taiwan, I was raised in a number of suburbs around Canada...",                                                                                                                                                                                 
      "image": "ReginaKid.jpg",
      "link": "https://livebetr.com/story/home-is-complicated",
      "date": "2020-03-24",
      "publication": "LiveBetr"
    },
    {
      "title": "The 10 Best Things to Do on a Japan Tour",
      "description": "Despite how exhilarating it is to book plane tickets overseas, planning a trip can also be overwhelming. With Japan, it seems like the stress is compounded...",
      "image": "FushimiInari.jpg",
      "link": "https: //www.gooverseas.com/blog/things-to-do-japan-tour",
      "date": "2019-10-31",
      "publication": "Go Overseas"
    },
    { 
      "title": "When is the Best Time to Study Abroad?",                                            
      "description": "For many, studying abroad is two birds, one stone kind of situation: you take the classes you need, while also fulfilling your insatiable itch to travel and see new places. Deciding to embark on the adventure...",                                                                                                                                               
      "image": "StockWomanSwinging.jpg", 
      "link": "https://www.gooverseas.com/blog/best-time-study-abroad-in-college",                                              
      "date": "2019-09-20", 
      "publication": "Go Overseas"
    },
    {
      "title": "10 Reasons Why Every Student Should Study Abroad",                                  
      "description": "In the months leading up to my freshman year of university, I read a variety of self-help articles and books about ensuring a successful college experience. Like any high-achieving student...",                                                                                                                                                                   
      "image": "WomanMountain.jpg",      
      "link": "https://www.gooverseas.com/blog/why-study-abroad",                                                                
      "date": "2019-09-11", 
      "publication": "Go Overseas"
    },
    {  
      "title": "What to Know Before Learning French Abroad",
      "description": "Among the countless benefits of studying in a foreign country, one of the most valuable advantages, in my opinion, is having the opportunity to master a foreign language. When I was deciding between universities as a high school senior, there was a multitude of reasons that I chose the school",
      "image": "RomanBoed.jpg",
      "link": "https://www.gooverseas.com/blog/know-before-learning-french-abroad",
      "date": "2018-07-20",
      "publication": "Go Overseas"
    },
    {
      "title": "What It Was Like to Be Studying Abroad in Paris During the 2015 Terrorist Attacks",
      "description": "What happens when disaster strikes while you’re abroad? What are you supposed to do? When I booked my one-way ticket to Paris, France for my semester abroad in 2015, these questions didn’t even cross my mind. Even if they had, no contingency...",
      "image": "Paris.jpg",
      "link": "https://www.gooverseas.com/blog/studying-abroad-paris-terrorist-attacks",
      "date": "2017-12-18",
      "publication": "Go Overseas"
    },
    {
      "title": "A Letter to My First-Year Self",                                                  
      "description": "Dear Regina, First of all, choosing McGill was absolutely, undoubtedly the right decision for you. You’ll have some doubts during the first few days after you move in, but trust me, that’s completely normal. Settling in here will take some time. Starting from scratch at...",                                                                                 
      "image": "McGill.jpg",            
      "link": "https://www.hercampus.com/school/mcgill/letter-my-first-year-self",                                             
      "date": "2016-04-14", 
      "publication": "Her Campus McGill"
    },
    {
      "title": "What it’s like growing up without a hometown",
      "description": "How do you answer the question ‘Where are you from?’ For most people, the question of identifying their hometown evokes a clear, succinct answer. “Boston, Massachusetts,” they might say, or perhaps, “A suburb outside of Toronto, Ontario.” Short...",
      "image": "ReginaKid-2.jpg",
      "link": "https://thetab.com/ca/mcgill/2016/04/02/like-growing-without-hometown-904",
      "date": "2016-04-02", 
      "publication": "The Tab McGill"
    },
    {
      "title": "Divest McGill holds three day sit-in at James Administration Building",             
      "description": "On March 29, Divest McGill set up camp at James Square and inside the James Administration Building to protest last week’s Board of Governors (BoG) decision for McGill not to divest from its holdings in fossil fuel companies, based on a report by the Committee to Advise [on] Matters of Social...",                                                          
      "image": "McGillProtest.jpg",      
      "link": "http://www.mcgilltribune.com/news/divest-mcgill-holds-three-day-sit-james-administration-building-123210/",       
      "date": "2016-04-01", 
      "publication": "The McGill Tribune"
    },
    {
      "title": "Police called to AUS/SUS Grad Ball to handle coat check debacle",                   
      "description": "The end of the sold-out 2016 Arts Undergraduate Society (AUS) and the Science Undergraduate Society (SUS) annual Grad Ball descended into chaos at coat check. Guests were unable to retrieve their belongings and around 2: 30 a.m. the police were called to intervene...",                                                                                        
      "image": "McGillBall.jpg",         
      "link": "http://www.mcgilltribune.com/news/police-called-aussus-grad-ball-handle-coat-check-debacle-290316/",              
      "date": "2016-03-30", 
      "publication": "The McGill Tribune"
    },
    {
      "title": "Ben Ger wins SSMU presidency amid low voter turnout",                              
      "description": "Following the second-lowest voter turnout since 2005, the Students’ Society of McGill University (SSMU) elected Ben Ger as SSMU President with 65.4 per cent of the vote over his opponent, Jordan Sinder. 17.5 per cent of the undergraduate student body participated...",                                                                                        
      "image": "SSMUPresidency.jpg",     
      "link": "http://www.mcgilltribune.com/news/ben-ger-wins-ssmu-presidency-amidst-low-voter-turnout-978456/",                 
      "date": "2016-03-18", 
      "publication": "The McGill Tribune"
    },
    {
      "title": "McGill sells Redpath properties for $20.6 million",                                 
      "description": "During the February Senate meeting, Christopher Manfredi, provost and vice-principal (VP) (Academic) announced the sale of a portion of McGill-owned land, resulting in an unanticipated $20.6 million in revenue for the university. Known as the Redpath properties and located to the west of...",                                                              
      "image": "RedpathNote.jpg",        
      "link": "http://www.mcgilltribune.com/news/mcgill-sells-redpath-properties-for-20-6-million-030716/",                     
      "date": "2016-03-08",
      "publication": "The McGill Tribune"
    },
    {
      "title": "Paris Periodical: Lessons Learned from a Semester in Paris",                        
      "description": "As relieved as I was to complete my last exam, it was quite a bittersweet affair. Although this means that I am at last free of all academic obligations (at least for the next few weeks, before I’m back at McGill for the winter term), it also means that my time in Paris...",                                                                                 
      "image": "Paris.jpg",              
      "link": "https://www.hercampus.com/school/mcgill/paris-periodical-lessons-learned-semester-paris",                         
      "date": "2015-12-15", 
      "publication": "Her Campus McGill"
    }
  ]
}